<a href="https://colab.research.google.com/github/shruthi-jay/pandas/blob/main/pytho.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

                                                  1. CREATING DATAFRAME  USING DIFFERENT METHODS

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.There are many ways of creating a dataframe. Few ways to create a dataframe are :

1.Create an empty DataFrame
    
       a) without any column name or indices and then appending columns one by one to it.

In [ ]:
# importing the pandas library  
import pandas as pd  
df = pd.DataFrame()  
print (df)  
df['Pokemon'] = ['Charmander', 'Pikachu', 'Squirtle']
df['Type'] = ['Fire','Electric','Water']
df['Hp'] = [58, 35, 44]
df

Empty DataFrame
Columns: []
Index: []

      Pokemon      Type  Hp
0  Charmander      Fire  58
1     Pikachu  Electric  35
2    Squirtle     Water  44

        b) with columns name only then appending rows one by one to it using append() method.

In [ ]:
import pandas as pd
# create an Empty DataFrame object With column names only
df = pd.DataFrame(columns = ['Nam', 'Type', 'Total'])
print(df)
# append rows to an empty DataFrame
df = df.append({'Nam':'Bulbasaur','Type':'Grass','Total':318},ignore_index = True)
df = df.append({'Nam':'Ivysaur','Type':'Grass','Total':405},ignore_index = True)
df = df.append({'Nam':' Venusaur','Type':'Grass','Total':525},ignore_index = True)
df

Empty DataFrame
Columns: [Nam, Type, Total]
Index: []

         Nam   Type Total
0  Bulbasaur  Grass   318
1    Ivysaur  Grass   405
2   Venusaur  Grass   525

      c) with a column name and indices and then appending rows one by one to it using loc[] method

In [ ]:
import pandas as pd
# create an Empty DataFrame object With column names and indices 
df = pd.DataFrame(columns = ['Hero', 'Agility', 'Accelerated Healing'], index = ['a', 'b', 'c'])
print("Empty DataFrame\n", df)
# adding rows to an empty  dataframe at existing index
df.loc['a'] = [' 3-D Man','True','False']
df.loc['b'] = ['A-Bomb','False','True']
df.loc['c'] = ['Abe Sapien','True','True']
df

Empty DataFrame
   Hero Agility Accelerated Healing
a  NaN     NaN                 NaN
b  NaN     NaN                 NaN
c  NaN     NaN                 NaN

         Hero Agility Accelerated Healing
a     3-D Man    True               False
b      A-Bomb   False                True
c  Abe Sapien    True                True

2) Create DataFrame using List

       a) with index and column names.

In [ ]:
import pandas as pd
# list of strings
lst = ['Snow White and the Seven Dwarfs','Pinocchio','Fantasia']
# Calling DataFrame constructor on list  with indices and columns specified
df = pd.DataFrame(lst, index =['1937-12-21', '1940-02-09',' 1940-11-13'],columns =['Movie'])
df

                                       Movie
1937-12-21   Snow White and the Seven Dwarfs
1940-02-09                         Pinocchio
 1940-11-13                         Fantasia

       b) using multi-dimensional list

In [ ]:
import pandas as pd 
lst = [['The Light Between Oceans','Drama'], ['Queen of Katwe','Drama'],
       ['Doctor Strange','Adventure'], ['Moana','Adventure']]
    
df = pd.DataFrame(lst, columns =['Movie', 'Type'])
df

                      Movie       Type
0  The Light Between Oceans      Drama
1            Queen of Katwe      Drama
2            Doctor Strange  Adventure
3                     Moana  Adventure

3) Create Dataframe from Numpy Array

In [ ]:
import pandas as pd
import numpy as np
# creating the Numpy array
array = np.array([['Earth','Documentary'], ['Up','Adventure'],
                  ['The Proposal','Romantic Comedy'], ['Toy Story 3D Double Feature','Adventure'], 
                  ['The Princess and the Frog','Adventure']])
# creating a list of index names
index_values = ['A', 'B', 'C', 'D', 'E']
# creating a list of column names
column_values = ['Movie', 'Age']
# creating the dataframe
df = pd.DataFrame(data = array, 
                  index = index_values, 
                  columns = column_values)
# displaying the dataframe
print(df)

                         Movie              Age
A                        Earth      Documentary
B                           Up        Adventure
C                 The Proposal  Romantic Comedy
D  Toy Story 3D Double Feature        Adventure
E    The Princess and the Frog        Adventure

4)Create data frame using dictionary

       a) using default Constructor of pandas-Dataframe class

In [ ]:
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'])
df

                              Title Format  Episode
a  Fullmetal Alchemist: Brotherhood     Tv       64
b                         your name  Movie        1
c                    A Silent Voice  Movie        1

  b) from Dictionary with required columns only.

In [ ]:
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'],columns = ['Title', 'Format'])
df

                              Title Format
a  Fullmetal Alchemist: Brotherhood     Tv
b                         your name  Movie
c                    A Silent Voice  Movie

        c) from dictionary with key and simple value

In [ ]:
import pandas as pd
# dictionary
details = {
    'Inception' : 2010,
    'Avengers: Infinity War' : 2018,
    'Back to the Future' : 1985,
    'Spider-Man: Into the Spider-Verse' :2018
    }
#creating a Dataframe object from a list of tuples of key, value pair
df = pd.DataFrame(list(details.items()))  
df

                                   0     1
0                          Inception  2010
1             Avengers: Infinity War  2018
2                 Back to the Future  1985
3  Spider-Man: Into the Spider-Verse  2018

       d) from nested Dictionary.

In [ ]:
import pandas as pd
# dictionary with dictionary object in values i.e. nested dictionary
details = { 
    0 : {
        'Title' :'Like Stars on Earth',
        'Year' : 2007,
        'IMDb rating' :8.4
        },
    1 : {
       'Title' :'A Silent Voice',
        'Year' :2016,
        'IMDb rating' :8.2
        },
    2 : {
         'Title' :'Bill Burr: Im Sorry You Feel That Way',
        'Year' :2014 ,
        'IMDb rating' :8.4
        },
    3:  {
        'Title':'The Pianist'   ,
         'Year' :2002   ,
         'IMDb rating' : 8.5
        },
    4:  {
        'Title':'Austin Powers: International Man of Mystery'    ,
         'Year' : 1997   ,
         'IMDb rating' : 7
        },
    5:  {
        'Title':'Paper Tiger',
         'Year' :2019,
         'IMDb rating' : 8.2
         },
    6:  {
        'Title':'Avengers: Infinity War',
         'Year' : 2018   ,
         'IMDb rating' : 8.5
    },
}
  
# creating a Dataframe object from nested dictionaryin which inside dictionary key is act as index valueand column value is 0, 1, 2...
df = pd.DataFrame(details)
# swap the columns with indexes
df = df.transpose()
df

                                         Title  Year IMDb rating
0                          Like Stars on Earth  2007         8.4
1                               A Silent Voice  2016         8.2
2        Bill Burr: Im Sorry You Feel That Way  2014         8.4
3                                  The Pianist  2002         8.5
4  Austin Powers: International Man of Mystery  1997           7
5                       Bill Burr: Paper Tiger  2019         8.2
6                       Avengers: Infinity War  2018         8.5

5)  copying an existing dataframe

In [ ]:
df1 = df.head(3).copy()
df1

                                   Title  Year IMDb rating
0                    Like Stars on Earth  2007         8.4
1                         A Silent Voice  2016         8.2
2  Bill Burr: Im Sorry You Feel That Way  2014         8.4



---

                                                   2.  CREATE DATAFRAME FROM CSV FILE AND SAVE AS CSV FILE

    a) Load data from local drive

In [ ]:
import pandas as pd

from google.colab import files
uploaded = files.upload()

Saving superheroes_power_matrix.csv to superheroes_power_matrix (2).csv

In [ ]:
import io

superheroes_df = pd.read_csv(io.BytesIO(uploaded['superheroes_power_matrix.csv']))
superheroes_df.head(2)

      Name  Agility  ...  Omnipresent  Omniscient
0  3-D Man     True  ...        False       False
1   A-Bomb    False  ...        False       False

[2 rows x 168 columns]

       b) From Github

In [ ]:
path='https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv'
pokemon_df = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, usecols = ['Name','Type 1','Attack','Defense','Speed'])
pokemon_df.head(7)

                    Name Type 1  Attack  Defense  Speed
0              Bulbasaur  Grass      49       49     45
1                Ivysaur  Grass      62       63     60
2               Venusaur  Grass      82       83     80
3  VenusaurMega Venusaur  Grass     100      123     80
4             Charmander   Fire      52       43     65
5             Charmeleon   Fire      64       58     80
6              Charizard   Fire      84       78    100

2) Save Dataframe as CSV file using to_csv() method

In [ ]:
data = {'Name':['Brad Pitt','Christopher Walken','Daniel Day-Lewis','Dustin Hoffman'],
        'Oscar':[1,1,3,2],
        'BAFTA':[1,1,4,4]}
df = pd.DataFrame(data)
df.to_csv('my_dataset.csv')



---

                                                       3. GROUP BY OPERATIONS IN DATAFRAME

Pandas dataframe.groupby() function is used to split the data into groups based on some criteria. pandas objects can be split on any of their axes.

  1)   Splitting to groups

In [2]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv')
gk = df.groupby('Type 1')
# Let's print the first entries in all the groups formed.
gk.first()

            #                     Name    Type 2  ...  Speed  Generation  Legendary
Type 1                                            ...
Bug        10                 Caterpie    Flying  ...     45           1      False
Dark      197                  Umbreon    Flying  ...     65           2      False
Dragon    147                  Dratini    Flying  ...     50           1      False
Electric   25                  Pikachu     Steel  ...     90           1      False
Fairy      35                 Clefairy    Flying  ...     35           1      False
Fighting   56                   Mankey   Psychic  ...     70           1      False
Fire        4               Charmander    Flying  ...     65           1      False
Flying    641  TornadusIncarnate Forme    Dragon  ...    111           5       True
Ghost      92                   Gastly    Poison  ...     80           1      False
Grass       1                Bulbasaur    Poison  ...     45           1      False
Ground     27                Sandshrew      Rock  ...     40           1      False
Ice       124                     Jynx   Psychic  ...     95           1      False
Normal     16                   Pidgey    Flying  ...     56           1      False
Poison     23                    Ekans    Ground  ...     55           1      False
Psychic    63                     Abra     Fairy  ...     90           1      False
Rock       74                  Geodude    Ground  ...     20           1      False
Steel     208                  Steelix    Ground  ...     30           2      False
Water       7                 Squirtle  Fighting  ...     43           1      False

[18 rows x 12 columns]

In [3]:
gk.last()

            #                   Name    Type 2  ...  Speed  Generation  Legendary
Type 1                                          ...
Bug       666               Vivillon    Flying  ...     89           6      False
Dark      717                Yveltal    Flying  ...     99           6       True
Dragon    718       Zygarde50% Forme    Ground  ...     95           6       True
Electric  702                Dedenne     Fairy  ...    101           6      False
Fairy     716                Xerneas    Flying  ...     99           6       True
Fighting  701               Hawlucha    Flying  ...    118           6      False
Fire      721              Volcanion     Water  ...     70           6       True
Flying    715                Noivern    Dragon  ...    123           6      False
Ghost     711    GourgeistSuper Size     Grass  ...     54           6      False
Grass     673                 Gogoat  Fighting  ...     68           6      False
Ground    645  LandorusTherian Forme    Flying  ...     91           5       True
Ice       713                Avalugg     Ghost  ...     28           6      False
Normal    676                Furfrou    Flying  ...    102           6      False
Poison    691               Dragalge    Dragon  ...     44           6      False
Psychic   720     HoopaHoopa Unbound      Dark  ...     80           6       True
Rock      719    DiancieMega Diancie     Fairy  ...    110           6       True
Steel     707                 Klefki     Fairy  ...     75           6      False
Water     693              Clawitzer      Dark  ...     59           6      False

[18 rows x 12 columns]

In [5]:
df.groupby('HP').sum().head(5)

       #  Total  Attack  Defense  ...  Sp. Def  Speed  Generation  Legendary
HP                                ...
1    292    236      90       45  ...       30     40           3          0
10    50    265      55       25  ...       45     95           1          0
20  1657   1715     140      455  ...      520    310          15          0
25   144    635      55       85  ...      110    135           2          0
28   280    198      25       25  ...       35     40           3          0

[5 rows x 9 columns]

 2) Select a Group

In [ ]:
gk.get_group('Water').head(5)

     #                     Name Type 2  ...  Speed  Generation  Legendary
9    7                 Squirtle    NaN  ...     43           1      False
10   8                Wartortle    NaN  ...     58           1      False
11   9                Blastoise    NaN  ...     78           1      False
12   9  BlastoiseMega Blastoise    NaN  ...     78           1      False
59  54                  Psyduck    NaN  ...     55           1      False

[5 rows x 12 columns]



---

                                                         4.  COMBINING AND MERGING DATASETS

a) Concatenating DataFrame

    1)  using concat() only

In [ ]:
#to concat a dataframe, we use .concat() function .this function concat a dataframe and returns a new dataframe.
import pandas as pd 
data1 = {'Movie':['Ice Princess', 'The Princess Diaries', 'Monsters, Inc.', 'The Jungle Book 2'], 
        'Year':[2005, 2001, 2001, 2003], 
        'Genre':['Comedy','Comedy', 'Adventure', 'Adventure']} 
   
# Define dictionary 
data2 = {'Movie':['Monsters University', 'Frozen', 'Thor: The Dark World', 'Into the Woods'], 
        'Year':[2013,2013, 2013,2014], 
        'Genre':['Adventure', 'Adventure', 'Adventure', 'Musical']} 

 
# Convert the dictionarys into DataFrames  
df1= pd.DataFrame(data1,index=[0, 1, 2, 3])
df2 = pd.DataFrame(data2, index=[4, 5, 6, 7])
frames = [df1, df2]
final_1 = pd.concat(frames)
final_1

                  Movie  Year      Genre
0          Ice Princess  2005     Comedy
1  The Princess Diaries  2001     Comedy
2        Monsters, Inc.  2001  Adventure
3     The Jungle Book 2  2003  Adventure
4   Monsters University  2013  Adventure
5                Frozen  2013  Adventure
6  Thor: The Dark World  2013  Adventure
7        Into the Woods  2014    Musical

    2)  Setting axis along with concat() to get intersection of dataframe

In [ ]:
# set axes join = inner   to get the intersection of dataframe
data3 = {'Movie':['Monsters, Inc.', 'The Jungle Book 2', 'Thor: The Dark World', 'Into the Woods'], 
        'Year':[2001, 2003, 2013,2014], 
        'Genre':['Adventure', 'Adventure', 'Adventure', 'Musical']} 
df3 = pd.DataFrame(data3,index=[2, 3, 6, 7]) 
#set axes join = inner for intersection of dataframe
final_2 = pd.concat([df1, df3], axis=1, join='inner')
final_2

               Movie  Year      Genre              Movie  Year      Genre
2     Monsters, Inc.  2001  Adventure     Monsters, Inc.  2001  Adventure
3  The Jungle Book 2  2003  Adventure  The Jungle Book 2  2003  Adventure

b) Merging DataFrame

    1)  Merge Two DataFrames on a Key

In [ ]:
# import the pandas library
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu'],
   'type':['Water','Fire','Poison','Bug','Electric']})
pd.merge(left,right,on='id')

   id     Name_x    type_x    Name_y    type_y
0   1  Bulbasaur     Grass    Lapras     Water
1   2  Wartortle     Water    Magmar      Fire
2   3    Flareon      Fire     Arbok    Poison
3   4     Kakuna       Bug  Beedrill       Bug
4   5    Pikachu  Electric    Raichu  Electric

    2)  Merge Two DataFrames on Multiple Keys

In [ ]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu'],
   'type':['Water','Fire','Poison','Bug','Electric']})
pd.merge(left,right,on=['id','type'])

   id   Name_x      type    Name_y
0   4   Kakuna       Bug  Beedrill
1   5  Pikachu  Electric    Raichu

    3)  Merge Using 'how' Argument

In [ ]:
#left join
pd.merge(left, right, on='type', how='left')

   id_x     Name_x      type  id_y    Name_y
0     1  Bulbasaur     Grass   NaN       NaN
1     2  Wartortle     Water   1.0    Lapras
2     3    Flareon      Fire   2.0    Magmar
3     4     Kakuna       Bug   4.0  Beedrill
4     5    Pikachu  Electric   5.0    Raichu

In [ ]:
#right join
pd.merge(left, right, on='type', how='right')

   id_x     Name_x      type  id_y    Name_y
0   2.0  Wartortle     Water     1    Lapras
1   3.0    Flareon      Fire     2    Magmar
2   NaN        NaN    Poison     3     Arbok
3   4.0     Kakuna       Bug     4  Beedrill
4   5.0    Pikachu  Electric     5    Raichu

In [ ]:
#outer join
pd.merge(left, right, on='type', how='outer')

   id_x     Name_x      type  id_y    Name_y
0   1.0  Bulbasaur     Grass   NaN       NaN
1   2.0  Wartortle     Water   1.0    Lapras
2   3.0    Flareon      Fire   2.0    Magmar
3   4.0     Kakuna       Bug   4.0  Beedrill
4   5.0    Pikachu  Electric   5.0    Raichu
5   NaN        NaN    Poison   3.0     Arbok

In [ ]:
#inner join
pd.merge(left, right, on='type', how='inner')

   id_x     Name_x      type  id_y    Name_y
0     2  Wartortle     Water     1    Lapras
1     3    Flareon      Fire     2    Magmar
2     4     Kakuna       Bug     4  Beedrill
3     5    Pikachu  Electric     5    Raichu

3)  Join
  
   Both join and merge can be used to combines two dataframes but the join method combines two dataframes on the basis of their indexes whereas the merge method is more versatile and allows us to specify columns beside the index to join on for both dataframes.



---

                                                         5. TYPES  OF INDEXING IN DATA FRAME

Indexing in pandas means simply selecting particular rows and columns of data from a DataFrame.Indexing can also be known as Subset Selection.

    1)  Indexing a Dataframe using indexing operator [] :

In [ ]:
# retrieving columns by indexing operator
first = pokemon_df["Name"]
first.head(7)

0                Bulbasaur
1                  Ivysaur
2                 Venusaur
3    VenusaurMega Venusaur
4               Charmander
5               Charmeleon
6                Charizard
Name: Name, dtype: object

In [ ]:
#In order to select multiple columns, we have to pass a list of columns in an indexing operator.
first = pokemon_df[["Attack", "Speed"]]
first.head(6)

   Attack  Speed
0      49     45
1      62     60
2      82     80
3     100     80
4      52     65
5      64     80

    2) indexing a DataFrame using .loc[ ] :

In [ ]:
#In order to select a single row using .loc[], we put a single row label in a .loc function.
first = data.loc["Pikachu"]
second = data.loc["Rattata"]
  
  
print(first, "\n\n\n", second)

#                   25
Type 1        Electric
Type 2             NaN
Total              320
HP                  35
Attack              55
Defense             40
Sp. Atk             50
Sp. Def             50
Speed               90
Generation           1
Legendary        False
Name: Pikachu, dtype: object


 #                 19
Type 1        Normal
Type 2           NaN
Total            253
HP                30
Attack            56
Defense           35
Sp. Atk           25
Sp. Def           35
Speed             72
Generation         1
Legendary      False
Name: Rattata, dtype: object

In [ ]:
#In order to select multiple rows, we put all the row labels in a list and pass that to .loc function.
# retrieving multiple rows by loc method


# retrieving multiple rows by loc method








/

KeyError: ignored

In [ ]:
#Selecting two rows and three columns

In [ ]:
# retrieving all rows and some columns by loc method
first = pokemon_df.loc[:, ["Name", "Attack"]]
first.head(5)

                    Name  Attack
0              Bulbasaur      49
1                Ivysaur      62
2               Venusaur      82
3  VenusaurMega Venusaur     100
4             Charmander      52

    3)  Indexing a DataFrame using .iloc[ ] :

In [ ]:
#Selecting a single row
now = pokemon_df.iloc[3] 
print(now)

Name       VenusaurMega Venusaur
Type 1                     Grass
Attack                       100
Defense                      123
Speed                         80
Name: 3, dtype: object

In [ ]:
#Selecting multiple 
now= pokemon_df.iloc [[3, 5, 7]]
now

                        Name Type 1  Attack  Defense  Speed
3      VenusaurMega Venusaur  Grass     100      123     80
5                 Charmeleon   Fire      64       58     80
7  CharizardMega Charizard X   Fire     130      111    100

In [ ]:
#Selecting two rows and two 
now = data.iloc [[3, 4], [1, 2]]
now

                      Type 1  Type 2
Name
VenusaurMega Venusaur  Grass  Poison
Charmander              Fire     NaN

In [ ]:
#Selecting all the rows and a some columns
now = pokemon_df.iloc [:, [1, 2]]
now.head(5)

  Type 1  Attack
0  Grass      49
1  Grass      62
2  Grass      82
3  Grass     100
4   Fire      52



---

                                                        6. AGGREGATION FUNCTION IN DATA FRAME